app/controllers/looks_controller.rb

  def index
    @user_looks = Look.find(:all,
      :limit => 20,
      :conditions => { :archived => false, :user_id => @current_user.id })
---
SELECT * FROM "looks" WHERE ("looks"."user_id" = 3 AND "looks"."archived" = 'f') LIMIT 20

  def edit
    @look = Look.find(params[:id])
---
SELECT * FROM "looks" WHERE ("looks"."id" = 4)

  def create
  	@look = @current_user.looks.build(params[:look])
    #@look = Look.new(params[:look])
    #@look.user_id = session[:user_id]
    @look.posted = Time.now
    @look.archived = false
    respond_to do |format|
      if @look.save
---
INSERT INTO "looks" ("posted", "created_at", "title", "updated_at", "published", "archived", "user_id", "content") VALUES('2010-06-06 00:37:02', '2010-06-06 00:37:02', 'blah blah blah', '2010-06-06 00:37:02', NULL, 'f', 7, '<p>&lt;object width="640" height="385"&gt;&lt;param name="movie" value="http://www.youtube.com/v/AYC2FUutdKA&amp;hl=en_US&amp;fs=1&amp;"&gt;&lt;/param&gt;&lt;param name="allowFullScreen" value="true"&gt;&lt;/param&gt;&lt;param name="allowscriptaccess" value="always"&gt;&lt;/param&gt;&lt;embed src="http://www.youtube.com/v/AYC2FUutdKA&amp;hl=en_US&amp;fs=1&amp;" type="application/x-shockwave-flash" allowscriptaccess="always" allowfullscreen="true" width="640" height="385"&gt;&lt;/embed&gt;&lt;/object&gt;</p>')

  def update
    @look = Look.find(params[:id])
    respond_to do |format|
      if @look.update_attributes(params[:look])
---
SELECT * FROM "looks" WHERE ("looks"."id" = 4)
UPDATE "looks" SET "updated_at" = '2010-06-08 02:17:22', "title" = ' This Is The Title of My Look' WHERE "id" = 5

  def show
    @look = Look.find(params[:id],
      :conditions => { :archived => false,
        :user_id => params[:user_id] })
---
SELECT * FROM "looks" WHERE ("looks"."id" = 4 AND ("looks"."user_id" = '3' AND "looks"."archived" = 'f'))

  def destroy
    @look = Look.find(params[:id])
    look_name = @look.title
    @look.archived = true
    @look.save
---
SELECT * FROM "looks" WHERE ("looks"."id" = 4)
UPDATE "looks" SET "updated_at" = '2010-06-05 17:20:50', "archived" = 't' WHERE "id" = 4