app/controllers/looks_controller.rb

  def show
    @look = Look.find(params[:id],
      :conditions => {:user_id => @current_user.id })
    @page = @look.pages.empty? ? @look.pages.first : nil
---
SELECT * FROM "pages" WHERE ("pages".look_id = 5)

  def destroy
    @look = Look.find(params[:id])
    title = @look.title
    look_id = @look.id
    destroyed = @look.destroy
---
DELETE FROM "looks" WHERE "id" = 1

  def unpublish
    @look = Look.find(params[:id])
    @look.published = false

    respond_to do |format|
      unless @look.save
---
SELECT * FROM "looks" WHERE ("looks"."id" = 5)
UPDATE "looks" SET "updated_at" = '2010-06-06 02:29:57', "published" = 'f' WHERE "id" = 5

  def publish
    @look = Look.find(params[:id])
    @look.published = true

    respond_to do |format|
      unless @look.save
---
SELECT * FROM "looks" WHERE ("looks"."id" = 5)
UPDATE "looks" SET "updated_at" = '2010-06-06 02:28:04', "published" = 't' WHERE "id" = 5