app/controllers/pages_controller.rb

  def index
    @look = Look.find(params[:look_id])
---
SELECT * FROM "looks" WHERE ("looks"."id" = 5)

  def new
    @look = Look.find(params[:look_id])
---
SELECT * FROM "looks" WHERE ("looks"."id" = 5)

  def edit
    @look = Look.find(params[:look_id])
    @page = Page.find(params[:id])
---
SELECT * FROM "looks" WHERE ("looks"."id" = 5)
SELECT * FROM "pages" WHERE ("pages".look_id = 5)

  def create
    @look = Look.find(params[:look_id])
    @page = @look.pages.build(params[:page])
    @page.posted = Time.now

    respond_to do |format|
      if @page.save
---
SELECT * FROM "looks" WHERE ("looks"."id" = 5)
INSERT INTO "pages" ("posted", "created_at", "title", "updated_at", "look_id", "content") VALUES('2010-06-09 15:56:16', '2010-06-09 15:56:16', 'Page 1', '2010-06-09 15:56:16', 1, '<p>This is my first page to my world shattering look</p>')

  def update
    @look = Look.find(params[:look_id])
    @page = Page.find(params[:id])

    respond_to do |format|
      if @page.update_attributes(params[:page])
---
SELECT * FROM "looks" WHERE ("looks"."id" = 5)
SELECT * FROM "pages" WHERE ("pages"."id" = 1)
UPDATE "pages" SET "updated_at" = '2010-06-09 16:09:29', "content" = '<p>This is my first page to my world shattering look</p>

  def show
    @page = Page.find(params[:id])
---
SELECT * FROM "pages" WHERE ("pages".look_id = 1)

  def destroy
    @page = Page.find(params[:id])
---
SELECT * FROM "pages" WHERE ("pages"."id" = 2)