app/controllers/pages_controller.rb

SELECT * FROM "pages" WHERE ("pages"."id" = 1 AND ("pages"."archived" = 'f'))
---
  def show
    @page = Page.find(params[:id], :conditions => { :archived => false })