app/controllers/published_looks_controller.rb

  def index
    @tags = Look.tag_counts(:conditions => ["looks.published = ?", true])
    @sort = params[:sort] || "date"
    sort = @sort == "date" ? "posted DESC" : "title ASC"
    @looks = Look.find_published(params[:page], sort)
---
SELECT * FROM "looks" WHERE (published = 't' AND archived = 'f') ORDER BY posted DESC LIMIT 10

  def user
    @user = User.find(params[:id])
    @sort = params[:sort] || "date"
    sort = @sort == "date" ? "posted DESC" : "title ASC"
    @looks = @user.looks.find_published(params[:page], sort)
---
SELECT * FROM "users" WHERE ("users"."id" = 3)
SELECT * FROM "looks" WHERE (user_id = '3' and published = 't' and archived = 'f')

  def view
    #debugger
    id = params[:look_id] || params[:id]
    @look = Look.find(id, :include => [:user, :pages])
---
SELECT * FROM "looks" WHERE ("looks"."id" = 5)
SELECT * FROM "pages" WHERE ("pages".look_id = 5) LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 3)
SELECT count(*) AS count_all FROM "pages" WHERE ("pages".look_id = 5)