app/controllers/published_looks_controller.rb

SELECT * FROM "looks" WHERE ("looks"."archived" = 'f' AND "looks"."published" = 't') ORDER BY posted DESC LIMIT 10
---
  def index
    @looks = Look.find(:all,
      :order => "posted DESC",
      :limit => 10,
      :conditions => {:published => true, :archived => false})