app/controllers/users_controller.rb

INSERT INTO "users" ("salt", "created_at", "photo_file_size", "birthdate", "updated_at", "photo_file_name", "hashed_password", "username", "photo_content_type", "display_name", "bio", "email") VALUES('21745694600.844666189975994', '2010-06-09 15:42:23', NULL, NULL, '2010-06-09 15:42:23', NULL, '074369b123215d3ea6a30bb87e98d38070f06db9', 'perrine4', NULL, 'Jimmy Perrine', NULL, 'xeno56@gmail.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 3)
UPDATE "users" SET "updated_at" = '2010-06-09 17:10:52', "photo_file_name" = 'stream,587,0.png', "bio" = '', "photo_file_size" = 37545, "photo_content_type" = 'image/png' WHERE "id" = 1
---
  def update
    @user = User.find(params[:id])
    User.update_settings(@user, User.new(params[:user]))

SELECT * FROM "users" WHERE ("users"."username" = 'perrine4') LIMIT 1
---
  def check_username
    @test_username = params[:username]
    @test_user = User.find_by_username(@test_username)